"status":"ok","totalResults":82033,"articles":[{"source":{"id":"engadget","name":"Engadget"},"author":"Karissa Bell","title":"Twitter is pausing ads and recommendations in Ukraine and Russia","description":"Twitter has temporarily paused ads in Ukraine and Russia, one of several steps the company is taking to highlight safety information and minimize “risks associated with the conflict in Ukraine.”“We’re temporarily pausing advertisements in Ukraine and Russia t…","url":"https://www.engadget.com/twitter-is-pausing-ads-and-recommendations-in-ukraine-and-russia-004617413.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2021-04/6903eb10-9d49-11eb-9ebc-d0c616a3ce25","publishedAt":"2022-02-26T00:46:17Z","content":"Twitter has temporarily paused ads in Ukraine and Russia, one of several steps the company is taking to highlight safety information and minimize risks associated with the conflict in Ukraine.\r\nWere … [+1517 chars]"},{"source":{"id":null,"name":"New York Times"},"author":"Trish Bendix","title":"Stephen Colbert Riffs on Joe Biden’s Sanctions Against Russia","description":"Colbert said Putin sought to keep the peace, and imitated Russia’s president: “I keep this piece of Ukraine. I keep that piece of Ukraine. I keep all the pieces of Ukraine.”","url":"https://www.nytimes.com/2022/02/23/arts/television/stephen-colbert-biden-russia-putin.html","urlToImage":"https://static01.nyt.com/images/2022/02/23/arts/23latenight/23latenight-facebookJumbo.png","publishedAt":"2022-02-23T06:40:39Z","content":"Putin appears to be inching toward a full-scale attack on Ukraine. Trump, of course, called him a genius and called the idea wonderful today. What kind of hotel room hidden camera video does that Put… [+684 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Karissa Bell","title":"Facebook turns on ‘lock profile’ tool for people in Ukraine","description":"Facebook’s security team is taking new steps to protect the accounts of users in Ukraine. The company is enabling its “lock profile” tool for people in the country, and building up a “Special Operations Center” to \"closely monitor\" what's happening in Ukraine…","url":"https://www.engadget.com/facebook-turns-on-lock-profile-tool-people-in-ukraine-184946515.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-02/cd7c07b0-94b2-11ec-9cb7-b9caf08d9536","publishedAt":"2022-02-24T18:49:46Z","content":"Facebooks security team is taking new steps to protect the accounts of users in Ukraine. The company is enabling its lock profile tool for people in the country, and building up a Special Operations … [+1116 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Jon Fingas","title":"Ukraine faces more cyberattacks amid Russian invasion fears","description":"Ukraine is grappling with more cyberattacks as fears of an imminent Russian invasion reach their climax. Netblocks and Gizmodo report Ukraine's defense ministry and two state-owned banks, Oshchadbank and Privatbank, have suffered denial-of-service attacks flo…","url":"https://www.engadget.com/ukraine-defense-ministry-bank-cyberattacks-russia-195410547.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-02/74d69780-8e93-11ec-bebb-e45aec1277d8","publishedAt":"2022-02-15T19:54:10Z","content":"Ukraine is grappling with more cyberattacks as fears of an imminent Russian invasion reach their climax. Netblocks and Gizmodo report Ukraine's defense ministry and two state-owned banks, Oshchadbank… [+1339 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Matt Burgess","title":"If Russia Invades Ukraine, TikTok Will See It Up Close","description":"As troops amass on Ukraine’s border, civilians capture it all on camera. Online sleuths are now unpacking the details.","url":"https://www.wired.com/story/russia-ukraine-military-photos-video/","urlToImage":"https://media.wired.com/photos/620d9cce147c464202612d82/191:100/w_1280,c_limit/Security-Russia-Ukraine-19military-equipment-positioned-in-convoy_lake-donuzlav_crimea_ukraine_15feb2022_wv2-(1).jpg","publishedAt":"2022-02-17T12:00:00Z","content":"On the snowy roads near Kursk, tanks and military equipment stop traffic. Videos from around the Russian cityroughly 100 miles from the border with Ukraineshow cars waiting in line to cross train tra… [+2929 chars]"},{"source":{"id":null,"name":"New York Times"},"author":"The New York Times","title":"Eight Years After Deadly Protest in Kyiv, Ukraine Faces Even Bigger Peril","description":"“What are you waiting for?” President Volodymyr Zelensky of Ukraine asked leaders in Munich, as shelling escalated in eastern Ukraine and Russian-backed rebels urged people to evacuate.","url":"https://www.nytimes.com/live/2022/02/20/world/ukraine-russia-news","urlToImage":"https://static01.nyt.com/images/2022/02/20/world/20Ukraine-briefing-promo/merlin_202523541_149ad28b-8076-4876-b590-94ee4c0ba9e1-facebookJumbo.jpg","publishedAt":"2022-02-20T09:17:05Z","content":"MUNICH In an appeal that was at times bitterly critical of the West, President Volodymyr Zelensky of Ukraine urged allies on Saturday to begin imposing sanctions on Russia now rather than wait for an… [+3776 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Justin Sherman","title":"Russia’s Cyber Threat to Ukraine Is Vast—and Underestimated","description":"The Kremlin's web of nonstate hackers can wreak just as much havoc as Putin's government.","url":"https://www.wired.com/story/russias-cyber-threat-to-ukraine-is-vast-and-underestimated/","urlToImage":"https://media.wired.com/photos/6217a4a197991fb112a4b569/191:100/w_1280,c_limit/Sec_Kremlin_GettyImages-1237675094.jpg","publishedAt":"2022-02-24T17:12:09Z","content":"Vladimir Putin launched an illegal, aggressive attack on Ukraine last night that has already killed dozens of soldiers and sent panic rippling through the world. Russian forces are air-striking citie… [+5086 chars]"},{"source":{"id":null,"name":"New York Times"},"author":"The New York Times","title":"Anxiety Rises in Ukraine","description":"As President Biden said a Russian invasion looked imminent, the crisis was taking a toll on Ukrainians. One put it this way: “everything is possible.”","url":"https://www.nytimes.com/live/2022/02/19/world/ukraine-russia-news","urlToImage":"https://static01.nyt.com/images/2022/02/18/world/live-blog-20220219-ukraine-russia-news-header/live-blog-20220219-ukraine-russia-news-header-facebookJumbo.jpg","publishedAt":"2022-02-19T05:45:58Z","content":"KYIV, Ukraine Every February seems to be difficult for Julia Po. It is the month she had to leave her home in Crimea in 2014, after Russian troops annexed it and pro-Moscow separatists took control o… [+4139 chars]"},{"source":{"id":null,"name":"New York Times"},"author":"The New York Times","title":"Russian Buildup Reaching ‘Crescendo,’ U.S. Warns as Diplomacy Sputters","description":"Chancellor Olaf Scholz of Germany was traveling to Ukraine before heading to Moscow on Tuesday, part of an urgent diplomatic push to defuse the crisis. Ukraine called on Russia to explain its menacing military buildup along its borders.","url":"https://www.nytimes.com/live/2022/02/14/world/russia-ukraine-news","urlToImage":"https://static01.nyt.com/images/2022/02/14/world/14ukraine-briefing-MORNING-LEDE-01/14ukraine-briefing-MORNING-LEDE-01-facebookJumbo.jpg","publishedAt":"2022-02-14T10:36:49Z","content":"With Russian warships massing off Ukraines Black Sea coast and the United States warning that Russian ground forces are poised to strike from multiple directions, Chancellor Olaf Scholz of Germany wi… [+3683 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Ukraine crisis: War, sickness and love in rebel-held Ukraine","description":"Orla Guerin talks to people who cross military checkpoints for medical treatment and to see family.","url":"https://www.bbc.co.uk/news/world-europe-60460003","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/A887/production/_123334134_larysasmiling.jpg","publishedAt":"2022-02-21T12:43:52Z","content":"By Orla GuerinBBC News, eastern Ukraine\r\nImage caption, \"We want to live, love We want to love everybody and give them a hug\" Larysa says, smiling through her mask\r\nCancer, a war that has dragged on … [+5151 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Ukraine crisis: Russia keeps troops in Belarus amid Ukraine fears","description":"The decision fuels renewed fears that Russia plans to invade Ukraine, despite denials from Moscow.","url":"https://www.bbc.co.uk/news/world-europe-60451955","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/A372/production/_123324814_mediaitem123324813.jpg","publishedAt":"2022-02-20T12:16:36Z","content":"Image caption, Civilians from separatist-held regions are being evacuated to Russia\r\nRussian President Vladimir Putin and his ally Belarusian leader Alexander Lukashenko have extended military drills… [+5066 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Ukraine crisis: Don't create panic, Ukraine tells West","description":"President Volodymyr Zelensky says warnings of a Russian invasion are putting the economy at risk.","url":"https://www.bbc.co.uk/news/world-europe-60174684","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/1658E/production/_123043519_mediaitem123043518.jpg","publishedAt":"2022-01-28T17:14:21Z","content":"Image caption, \"We don't need this panic,\" Mr Zelensky said\r\nUkraine's President Volodymyr Zelensky has called on the West not to create \"panic\" amid the build-up of Russian troops on his country's b… [+3086 chars]"},{"source":{"id":null,"name":"New York Times"},"author":"The Editorial Board","title":"Little Time Left to Avert the Worst-Case Scenario in Ukraine","description":"The magnitude of Mr. Putin’s gambit in Ukraine is staggering.","url":"https://www.nytimes.com/2022/02/23/opinion/ukraine-biden-putin-invasion.html","urlToImage":"https://static01.nyt.com/images/2022/02/23/opinion/23ukraine/23ukraine-facebookJumbo.jpg","publishedAt":"2022-02-23T21:43:19Z","content":"The magnitude of the Russian gambit is staggering. Whatever Mr. Putins ideas on how Ukraine should relate to Russia, whatever his grievances over Western encroachment on what he perceives as Russias … [+1861 chars]"},{"source":{"id":null,"name":"New York Times"},"author":"Richard N. Haass","title":"Putin’s Ukraine Invasion Is Underway, and the West Must Respond","description":"Russia’s invasion of Ukraine calls for a determined, comprehensive response.","url":"https://www.nytimes.com/2022/02/24/opinion/russia-ukraine-invasion-putin.html","urlToImage":"https://static01.nyt.com/images/2022/02/24/opinion/24Hass/24Hass-facebookJumbo.jpg","publishedAt":"2022-02-24T05:01:05Z","content":"Instead, Mr. Putin is choosing the path of war. This calls for a determined, comprehensive reply from the West. Mr. Putins war of choice demands a response of necessity.\r\nThe West should aim to penal… [+2013 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"Meghan Moravcik Walbert","title":"How to Talk to Kids and Teens About the Crisis in Ukraine","description":"As the adults of the world watch Russia invade Ukraine, unleashing what many fear will be the biggest war in Europe since 1945 and potentially affecting global fuel, food, and metals prices (among the obvious other impacts of war), our kids may be absorbing n…","url":"https://lifehacker.com/how-to-talk-to-kids-and-teens-about-the-crisis-in-ukrai-1848589761","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/dc7bc855b0f67d418ffb78c59aaae80a.jpg","publishedAt":"2022-02-24T21:30:00Z","content":"As the adults of the world watch Russia invade Ukraine, unleashing what many fear will be the biggest war in Europe since 1945 and potentially affecting global fuel, food, and metals prices (among th… [+5802 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Mariella Moon","title":"US and Britain blame Russia for cyberattacks on Ukraine's websites","description":"Russia is responsible for the cyberattacks that took down the websites for Ukraine's government agencies and major banks back in January, according to The White House. Anne Neuberger, the administration's deputy national security adviser, said the government …","url":"https://www.engadget.com/us-britain-blame-russia-cyberattacks-ukraine-websites-112610459.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-02/c16e7270-9168-11ec-bfe3-fc1ee869e8c7","publishedAt":"2022-02-19T11:26:10Z","content":"Russia is responsible for the cyberattacks that took down the websites for Ukraine's government agencies and major banks back in January, according to The White House. Anne Neuberger, the administrat… [+2007 chars]"},{"source":{"id":null,"name":"New York Times"},"author":"The New York Times","title":"U.S. Offers Written Response to Russian Demands","description":"A  soldier in Ukraine opened fire at a rocket factory in eastern Ukraine, killing five fellow soldiers. There was no immediate connection between the shooting and rising military tensions.","url":"https://www.nytimes.com/live/2022/01/27/world/ukraine-russia-us","urlToImage":"https://static01.nyt.com/images/2022/01/26/multimedia/26vid-ukraine-blinken/26vid-ukraine-blinken-facebookJumbo.jpg","publishedAt":"2022-01-27T07:19:01Z","content":"Video\r\nBack\r\nThe United States delivered a written response to Russias demands in Eastern Europe, which included its concerns over escalating military tensions in the region.CreditCredit...Pool photo… [+4447 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Mariella Moon","title":"Twitter restores suspended accounts that tracked Russian military activity","description":"Twitter has admitted that it mistakenly removed accounts sharing Russian military activity in the midst of the Ukraine invasion. As TechCrunch notes, the deleted accounts, which have since been reinstated, included an aggregator of user-generated posts from U…","url":"https://www.engadget.com/twitter-restores-suspended-accounts-russian-military-activity-080401248.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-02/20c8dbd0-9541-11ec-bdcf-e6889b1181fd","publishedAt":"2022-02-24T08:04:01Z","content":"Twitter has admitted that it mistakenly removed accounts sharing Russian military activity in the midst of the Ukraine invasion. As TechCrunch notes, the deleted accounts, which have since been reins… [+1699 chars]"},{"source":{"id":null,"name":"New York Times"},"